create database Цветочный_Салон
go

use Цветочный_Салон
go

create table Типы_Товаров
(
ID_Типа int primary key identity,
Наименование varchar(25) unique  not null
)
go

insert into Типы_Товаров(Наименование)
values	('Букеты'),
		('Цветы'),
		('Горшки'),
		('Комнатные растения'),
		('Садовые растения'),
		('Уход за растениями')
go

create table Товары
(
ID_Товара int primary key identity,
Наименование varchar(50) unique not null,
Тип_Товара int foreign key references Типы_Товаров(ID_Типа) not null,
Длина_см int not null,
Ширина_см int not null,
Высота_см int not null,
Описание varchar(255) not null,
Стоимость money not null
)
go

insert into Товары(Наименование, Тип_Товара, Длина_см, Ширина_см, Высота_см, Кр_опис, Описание, Стоимость)
values	('Весеннее настроение','1','30','30','65','','','1670'),
		('Празничный','1','25','30','70','','','1940'),
		('Нежное прикосновение','1','40','40','76','','','2100'),
		('','1','','','','','',''),
		('','1','','','','','',''),
		('','1','','','','','',''),
		('','2','','','','','',''),
		('','2','','','','','',''),
		('','2','','','','','',''),
		('','2','','','','','',''),
		('','2','','','','','',''),
		('','2','','','','','',''),
		('','3','','','','','',''),
		('','3','','','','','',''),
		('','3','','','','','',''),
		('','3','','','','','',''),
		('','3','','','','','',''),
		('','3','','','','','',''),
		('','4','','','','','',''),
		('','4','','','','','',''),
		('','4','','','','','',''),
		('','4','','','','','',''),
		('','4','','','','','',''),
		('','4','','','','','',''),
		('','5','','','','','',''),
		('','5','','','','','',''),
		('','5','','','','','',''),
		('','5','','','','','',''),
		('','5','','','','','',''),
		('','5','','','','','',''),
		('','6','','','','','',''),
		('','6','','','','','',''),
		('','6','','','','','',''),
		('','6','','','','','',''),
		('','6','','','','','',''),
		('','6','','','','','','')
go

create table Склад
(
ID_Склада int primary key identity,
Вместительность int not null
)
go

insert into Склад(Вместительность)
values	('670')
go

create table Товары_на_складе
(
ID_Записи int primary key identity,
Склад int foreign key references Склад(ID_Склада) not null,
Товар int foreign key references Товары(ID_Товара) not null,
Количество int not null
)
go

create table Представители_поставщиков
(
ID_Представителя int primary key identity, 
Фамилия varchar(25) not null,
Имя varchar(25) not null,
Отчество varchar(25) not null,
Телефон varchar(20) not null,
)
go

insert into Представители_поставщиков(Фамилия, Имя, Отчество, Телефон)
values	('Томашков','Артем','Игоревич','+7 950 900 81 69'),
		('Жуйков','Евгений','Олегович','+7 930 560 86 27'),
		('Демиденок','Алина','Ивановна','+7 952 400 40 18'),
		('Жидарев','Даниил','Матвеевич','+7 492 590 21 43'),
		('Боронко','Оксана','Сергеевна','+7 560 900 90 90')
go

create table Поставщики
(
ID_Поставщика int primary key identity,
Название_компании varchar(50) unique not null,
Адрес_компании varchar(255) not null,
Контактное_лицо int foreign key references Представители_поставщиков(ID_Представителя) not null
)
go

insert into Поставщики (Название_компании, Адрес_компании, Контактное_лицо)
values	('Florist.ru','Омск, Герцена-158А','1'),
		('Руспласт','Омск, Ивановская-98Б, Цех №14','2'),
		('Букетная галерея','Омск, Ленина-213','3'),
		('Земельные просторы','Новосибирск, Пушкинская-52Г','4'),
		('SeedsGrow','Новосибирск, Старый-арбат-74','5')
go

create table Поставки
(
ID_Поставки int primary key identity,
Поставщик int foreign key references Поставщики(ID_Поставщика) not null,
Дата_поставки date not null
)
go

insert into Поставки(Поставщик, Дата_поставки)
values	('1','2021-02-01'),
		('2','2021-02-03'),
		('1','2021-02-05'),
		('1','2021-02-06'),
		('2','2021-02-06'),
		('3','2021-02-06'),
		('3','2021-02-10'),
		('4','2021-02-10'),
		('4','2021-02-11'),
		('3','2021-02-15'),
		('3','2021-02-17'),
		('5','2021-02-15'),
		('5','2021-02-17'),
		('5','2021-02-19'),
		('1','2021-02-19'),
		('3','2021-02-20')
go

create table Товары_в_поставках
(
ID_Записи int primary key identity,
Поставка int foreign key references Поставки(ID_Поставки) not null,
Товар int foreign key references Товары(ID_Товара) not null,
Количество int not null
)
go

create table Роли_Пользователей
(
ID_Роли int primary key identity,
Наименование varchar(25) unique not null 
)
go

insert into Роли_Пользователей
values	('Пользователь'),
		('Кассир'),
		('Администратор')
go

create table Пользователи
(
ID_Пользователя int primary key identity,
Логин varchar(25) unique not null,
Пароль varchar(25) not null,
Роль int foreign key references Роли_Пользователей(ID_Роли) not null
)
go

insert into Пользователи(Логин, Пароль, Роль)
values	('user','user','1'),
		('cash','cash','2'),
		('admin','admin','3')
go

insert into Пользователи(Логин, Пароль, Роль)
values	('cash1','cash1','2'),
		('admin1','admin1','3')

go

create table Сотрудники
(
ID_Сотрудника int primary key identity,
Фамилия varchar(25) not null, 
Имя varchar(25) not null, 
Отчество varchar(25) not null, 
Телефон varchar(25) not null,
Данные_для_входа int foreign key references Пользователи(ID_Пользователя) not null
)
go

insert into Сотрудники(Фамилия, Имя, Отчество, Телефон, Данные_для_входа)
values	
		('Терницкая','Анастасия','Вячеславовна','+7 923 450 90 62','2'),
		('Прокопчук','Тимофей','Иванович','+7 950 550 41 29','4'),
		('Чудаев','Александр','Петрович','+7 983 601 90 50','3'),
		('Руденко','Дмитрий','Андреевич','+7 923 887 54 74','5')
go		
DBCC CHECKIDENT (Сотрудники, RESEED,0)
go
create table Клиенты
(
ID_Клиента int primary key identity,
Фамилия varchar(25) not null,
Имя varchar(25) not null,
Телефон varchar(25) not null,
Данные_для_входа int foreign key references Пользователи(ID_Пользователя) not null
)
go

insert into Клиенты(Фамилия, Имя, Телефон, Данные_для_входа)
values	('Генш','Данил','+7 973 187 71 92','1')
go

create table Заказы
(
ID_Заказа int primary key identity,
Товар int foreign key references Товары(ID_Товара) not null,
Количество int not null,
Способ_доставки varchar(30) not null,
Способ_оплаты varchar(30) not null,
Адрес_доставки varchar(150) not null,
Дата_заказа date not null,
Сумма_заказа money not null
)
go

create table Заказы_клиентов
(
ID_Записи int primary key identity,
Заказ int foreign key references Заказы(ID_Заказа) not null,
Клиент int foreign key references Клиенты(ID_Клиента) not null
)
go